In [2]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['CS', 'Math', 'CS', 'Physics', 'Math'],
    'Score': [88, 92, 85, 70, 95],
    'Graduated': [True, True, False, True, False]
}

df = pd.DataFrame(data)
print(df)

      Name  Age Department  Score  Graduated
0    Alice   24         CS     88       True
1      Bob   27       Math     92       True
2  Charlie   22         CS     85      False
3    David   32    Physics     70       True
4      Eva   29       Math     95      False

In [16]:
df.head(3)     # First 3 rows
df.tail(2)     # Last 2 rows
df.shape       # (5, 5)
#df.info()      # Data types & null values
df.describe()

             Age      Score
count   5.000000   5.000000
mean   26.800000  86.000000
std     3.962323   9.721111
min    22.000000  70.000000
25%    24.000000  85.000000
50%    27.000000  88.000000
75%    29.000000  92.000000
max    32.000000  95.000000

In [31]:
df['Score']   ## Select column or df.Score

0    88
1    92
2    85
3    70
4    95
Name: Score, dtype: int64

In [25]:
df[['Name', 'Score']]  ## Select multiple columns

      Name  Score
0    Alice     88
1      Bob     92
2  Charlie     85
3    David     70
4      Eva     95

In [27]:
df.loc[0]   #Select row by label (assign index first if needed)

Name          Alice
Age              24
Department       CS
Score            88
Graduated      True
Name: 0, dtype: object

In [29]:
df.iloc[2]    #Select row by integer position

Name          Charlie
Age                22
Department         CS
Score              85
Graduated       False
Name: 2, dtype: object

In [33]:
# Students who scored more than 85
df[df['Score'] > 85]

    Name  Age Department  Score  Graduated
0  Alice   24         CS     88       True
1    Bob   27       Math     92       True
4    Eva   29       Math     95      False

In [37]:
# Students from CS department
df[df['Department'] == 'Math']

  Name  Age Department  Score  Graduated
1  Bob   27       Math     92       True
4  Eva   29       Math     95      False

In [39]:
# Sort by Score ascending
df.sort_values(by='Score')

      Name  Age Department  Score  Graduated
3    David   32    Physics     70       True
2  Charlie   22         CS     85      False
0    Alice   24         CS     88       True
1      Bob   27       Math     92       True
4      Eva   29       Math     95      False

In [45]:
df.sort_values(by='Score', ascending=False)   ## Sort by Age descending

      Name  Age Department  Score  Graduated
4      Eva   29       Math     95      False
1      Bob   27       Math     92       True
0    Alice   24         CS     88       True
2  Charlie   22         CS     85      False
3    David   32    Physics     70       True

In [50]:
df.rename(columns={'Score': 'FinalScore'}, inplace=True)  #Renaming columns